# Pandas Functions

In [1]:
import numpy as np
import pandas as pd

In [3]:
# Abs() - Absolute value of data
data = [[1,2,3,-4],[5,6,-7,-8]]
df = pd.DataFrame(data)

In [5]:
df.abs()

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [6]:
# Add() - add a value to each of the values in the dataframe

In [8]:
df

   0  1  2  3
0  1  2  3 -4
1  5  6 -7 -8

In [9]:
df.add(1)

   0  1  2  3
0  2  3  4 -3
1  6  7 -6 -7

In [18]:
# Add_prefix()
df1 = df.add_prefix("New ")

In [19]:
df1

   New 0  New 1  New 2  New 3
0      1      2      3     -4
1      5      6     -7     -8

In [16]:
# add_suffix()
df2 = df.add_suffix(" next ")

In [17]:
df2

   0 next   1 next   2 next   3 next
0        1        2        3       -4
1        5        6       -7       -8

In [20]:
# Agregation fuctions all columns- agg()
df3 = df.agg(['sum'])

In [21]:
df3

     0  1  2   3
sum  6  8 -4 -12

In [27]:
 # Aggreation all columns   - aggregate()
df4 = df.aggregate(['sum'])

In [28]:
df4

     0  1  2   3
sum  6  8 -4 -12

In [91]:
data1 = [[1,np.nan,3,-4],[5,np.nan,-7,-8],[True,False,False,False]]
df5 = pd.DataFrame(data1)

In [92]:
df5

      0      1      2      3
0     1    NaN      3     -4
1     5    NaN     -7     -8
2  True  False  False  False

In [93]:
# All - Check for all values in each row (index) whether True or not
df5.all()

0     True
1    False
2    False
3    False
dtype: bool

In [51]:
# Any()
df5.any()

0    True
1    True
2    True
3    True
dtype: bool

In [52]:
data2 = [[np.nan,np.nan,np.nan,np.nan],[np.nan,np.nan,np.nan,np.nan],[False,False,False,False]]
df6 = pd.DataFrame(data2)

In [53]:
df6.any()

0    False
1    False
2    False
3    False
dtype: bool

In [56]:
# Append()
df7 = df5.append(df)

In [57]:
df7

       0      1      2      3
0      1      2      3     -4
1      5      6     -7     -8
2  False  False  False  False
0      1      2      3     -4
1      5      6     -7     -8

In [58]:
# Apply()
def sumnum(x):
    return x.sum()

df8 = df

In [59]:
df8

   0  1  2  3
0  1  2  3 -4
1  5  6 -7 -8

In [60]:
df9 = df8.apply(sumnum)

In [61]:
df9

0     6
1     8
2    -4
3   -12
dtype: int64

In [63]:
# Assign() - Assign a new column to the df
df10 = df8.assign(name =['A','B'])

In [64]:
df10

   0  1  2  3 name
0  1  2  3 -4    A
1  5  6 -7 -8    B

In [94]:
# Applymap() - works like Apply but used for each and every element in the dataframe

In [68]:
data3 = {'x':['a','b','c'], 'y': ['d','e','f']}

In [71]:
df11 = pd.DataFrame(data3)
df11

   x  y
0  a  d
1  b  e
2  c  f

In [72]:
def makeupper(x):
    return x.upper()

In [73]:
df12 = df11.applymap(makeupper)

In [74]:
df12

   x  y
0  A  D
1  B  E
2  C  F

In [75]:
df

   0  1  2  3
0  1  2  3 -4
1  5  6 -7 -8

In [76]:
df8

   0  1  2  3
0  1  2  3 -4
1  5  6 -7 -8

In [77]:
df13 = df8.apply(lambda x: x+1)
df13

   0  1  2  3
0  2  3  4 -3
1  6  7 -6 -7

In [95]:
# at() 
df12

   x  y
0  A  D
1  B  E
2  C  F

In [98]:
df12.at[0,'y']

'D'

In [103]:
df.axes

[RangeIndex(start=0, stop=2, step=1), RangeIndex(start=0, stop=4, step=1)]

In [104]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [105]:
df15 = df

In [106]:
df15

   0  1  2  3
0  1  2  3 -4
1  5  6 -7 -8

In [107]:
df15.bfill()

   0  1  2  3
0  1  2  3 -4
1  5  6 -7 -8

In [112]:
df15 = pd.DataFrame(data2)
df15

       0      1      2      3
0    NaN    NaN    NaN    NaN
1    NaN    NaN    NaN    NaN
2  False  False  False  False

In [114]:
# Replace NULL values with from the next row
df15.bfill()

       0      1      2      3
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False

In [115]:
data3 = [[np.nan,np.nan,np.nan,np.nan],[1,2,3,4],[False,False,False,False]]

In [116]:
df16 = pd.DataFrame(data3)

In [117]:
df16

       0      1      2      3
0    NaN    NaN    NaN    NaN
1      1      2      3      4
2  False  False  False  False

In [118]:
df16.bfill()

       0      1      2      3
0      1      2      3      4
1      1      2      3      4
2  False  False  False  False

In [119]:
# Combine() method - used for combining two df's based on certain conditions
#df.combine()

In [123]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [4, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})
print(df1)
print(df2)

   A  B
0  0  4
1  0  4
   A  B
0  1  3
1  1  3

In [124]:
take_smaller = lambda s1, s2: s1 if s1.sum() < s2.sum() else s2

In [125]:
df1.combine(df2, take_smaller)

   A  B
0  0  3
1  0  3

In [133]:
list1 = [[1,2],[3,4]]
list2 = [[5,6],[7,8]]

In [134]:
dfr1 = pd.DataFrame(list1)

In [135]:
dfr2 = pd.DataFrame(list2)

In [143]:
def funct1(a,b):
    if a>b:
        return a
    else:
        return b 
funct1(1,2)

2

In [144]:
#dfr1.combine(dfr2, funct1)